resume/hrmresume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-31 Thu 16:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hassan McGinnis" />
<link rel="stylesheet" type="text/css" href="resume.css"/>
</head>
<body>
<div id="content">
<div id="outline-container-org506691a" class="outline-2 row title">
<h2 id="hassan-mcginnis">Hassan McGinnis</h2>
<div class="outline-text-2" id="text-hassan-mcginnis">
<p>
Controls Engineer <b>|</b> Software Developer
</p>

<p>
Natick, MA <b>|</b> <b>(502) 295-8499</b>
</p>

<p>
<a href="mailto:hassan.mcginnis@gmail.com">hassan.mcginnis@gmail.com</a> <b>|</b> <a href="https://hrmcginnis.github.io/">hrmcginnis.github.io</a>
</p>
</div>
</div>

<div id="outline-container-orgebbb42a" class="outline-2">
<h2 id="orgebbb42a"></h2>
<div class="outline-text-2" id="text-orgebbb42a">
<hr />
</div>

<div id="outline-container-org8f53655" class="outline-3 row">
<h3 id="summary">Summary</h3>
<div class="outline-text-3" id="text-summary">
<p>
I'm an engineer with professional software development and test experience using MATLAB, Simulink, and C++, as well as research experience in robust control and signal processing for structural vibration analysis.
</p>
</div>
</div>

<div id="outline-container-orgce7c0b3" class="outline-3 row">
<h3 id="software-skills">Software Skills</h3>
<div class="outline-text-3" id="text-software-skills">
<p>
<b>Tools/Environments</b>: MATLAB, Simulink, Stateflow, GNU/Linux, Emacs
</p>

<p>
<b>Languages</b>: MATLAB, C++, bash, python
</p>
</div>
</div>

<div id="outline-container-org25ad232" class="outline-3 row notext">
<h3 id="work-experience">Work Experience</h3>
<div class="outline-text-3" id="text-work-experience">
</div>
<div id="outline-container-org7d70352" class="outline-4 col notext">
<h4 id="org7d70352"></h4>
<div class="outline-text-4" id="text-org7d70352">
</div>
<div id="outline-container-org039fbeb" class="outline-5">
<h5 id="medacuity-software-software-specialist">MedAcuity Software | Software Specialist | Westford, MA</h5>
<div class="outline-text-5" id="text-medacuity-software-software-specialist">
<p>
<i>July 2017 - present</i>
</p>

<ul class="org-ul">
<li>Software consultant for clients in the medical device industry, serving as the domain expert with MATLAB and Simulink test and development.</li>
</ul>
</div>
</div>

<div id="outline-container-org5f18fd8" class="outline-5">
<h5 id="mathworks-senior-application-engineer-post-sales">MathWorks | Senior Application Engineer (Post-sales) | Natick, MA</h5>
<div class="outline-text-5" id="text-mathworks-senior-application-engineer-post-sales">
<p>
<i>Sept 2013 - July 2016</i>
</p>

<ul class="org-ul">
<li>As a domain expert in Simulink code generation workflows, provided solutions for major customers using Simulink Coder and Embedded Coder for production C/C++ code generation.</li>
<li>Developed/advocated for software improvements for MATLAB and Simulink based on customer needs, including achievement of MISRA compliant code, enhanced user customization of generated code, and improved support for third-party compilers.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b413a9" class="outline-3 row notext">
<h3 id="projects">Projects</h3>
<div class="outline-text-3" id="text-projects">
</div>
<div id="outline-container-org226887c" class="outline-4 col notext">
<h4 id="org226887c"></h4>
<div class="outline-text-4" id="text-org226887c">
</div>
<div id="outline-container-org8841895" class="outline-5">
<h5 id="medacuity-software-verification">MedAcuity Software | Verification of Controls Software for Surgical Robot</h5>
<div class="outline-text-5" id="text-medacuity-software-verification">
<p>
<i>Aug 2017 - present</i>
</p>

<ul class="org-ul">
<li>Developed a comprehensive strategy for verification and full MC/DC test coverage of Simulink-based state machines and control algorithms governing robotic arm motion.</li>
<li>Lead a team of engineers through verification of over 400 functional and non-functional software requirements implemented in Simulink, C++, and MATLAB code.</li>
<li>Collaborated with a third-party software vendor to unit test custom software that enables Simulink code generation and compilation for the QNX Neutrino real-time operating system.</li>
</ul>
</div>
</div>

<div id="outline-container-org66bc473" class="outline-5">
<h5 id="mathworks-python-system-object">MathWorks | Development of Python System Object for Simulink Raspberry Pi Support Package</h5>
<div class="outline-text-5" id="text-mathworks-python-system-object">
<p>
<i>May 2016</i>
</p>

<ul class="org-ul">
<li>Developed a Simulink block in MATLAB and C for the Raspberry Pi support package that interfaces with the Python/C API, allowing users to easily send simulation data to any Python module on the Raspberry Pi in soft real-time.</li>
<li>Demonstrated the functionality by using Simulink to drive a servomotor with a Raspberry Pi using the RaspiRobot Python library.</li>
</ul>
</div>
</div>

<div id="outline-container-orgeea5ac0" class="outline-5">
<h5 id="purdue-h-infinity-control">Purdue University | Sensitivity analysis of wear prognosis in an \(H_\infty\) controlled F-16 simulation</h5>
<div class="outline-text-5" id="text-purdue-h-infinity-control">
<p>
<i>Aug 2010 - Dec 2011</i>
</p>

<ul class="org-ul">
<li>Investigated the minimization of fault propagation in a hydraulic actuator through real-time adjustment in the commanded flight path.</li>
<li>Developed a robust altitude controller for an F-16 fighter aircraft model using \(H_\infty\) synthesis.</li>
<li>Performed sensitivity analysis of the path adjustment algorithm under modeling error.</li>
<li>Demonstrated the improved control strategy using a hydraulic solenoid valve hardware-in-the-loop system prototyped in Simulink and driven by dSPACE software.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd27bc45" class="outline-3 row notext">
<h3 id="education">Education</h3>
<div class="outline-text-3" id="text-education">
</div>

<div id="outline-container-org903a73e" class="outline-4">
<h4 id="purdue-university">Purdue University</h4>
<div class="outline-text-4" id="text-purdue-university">
<p>
MS Mechanical Engineering <b>|</b> 3.81/4.00 <b>|</b> Dec 2011
</p>
</div>
</div>

<div id="outline-container-org325833d" class="outline-4">
<h4 id="university-of-kentucky">University of Kentucky</h4>
<div class="outline-text-4" id="text-university-of-kentucky">
<p>
​BS Mechanical Engineering <b>|</b> 3.46/4.00 <b>|</b> May 2009
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
